{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d9d5b50a",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bb238976",
   "metadata": {},
   "source": [
    "# Neo4J CRUD"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "c7e488b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "class App:\n",
    "\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        # Don't forget to close the driver connection when you are finished with it\n",
    "        self.driver.close()\n",
    "        \n",
    "    def create_skill(self, concept_uri, preferred_label, description):\n",
    "        with self.driver.session() as session:\n",
    "            # Write transactions allow the driver to handle retries and transient errors\n",
    "            result = session.write_transaction(self._create_and_return_skill, \n",
    "                                               concept_uri, preferred_label, description)\n",
    "            \n",
    "    @staticmethod\n",
    "    def _create_and_return_skill(tx, concept_uri, preferred_label, description):\n",
    "        query = (\n",
    "            \"CREATE (skill:Skill {concept_uri: $concept_uri, \\\n",
    "            preferred_label: $preferred_label, description: $description})\"\n",
    "            \"RETURN skill\"\n",
    "        )\n",
    "\n",
    "        results = tx.run(query, concept_uri=concept_uri, \n",
    "                             preferred_label=preferred_label, \n",
    "                             description=description)\n",
    "    \n",
    "    def create_skills(self, csv_path):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._create_skills, csv_path)\n",
    "            \n",
    "    @staticmethod\n",
    "    def _create_skills(tx, csv_path):\n",
    "        assert \"http\" in csv_path, \"Loading csv files from local is \\\n",
    "        not possible due to security reasons, please use online files.\" \n",
    "        query = (\n",
    "            \"LOAD CSV WITH HEADERS FROM $csv_path AS skill \\\n",
    "            CREATE (:Skill {concept_uri: skill.concept_uri, \\\n",
    "            preferred_label: skill.preferred_label, description: skill.description})\"\n",
    "        )\n",
    "        results = tx.run(query, csv_path=csv_path)\n",
    "        \n",
    "    def create_course(self, course_name, course_id, course_description):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._create_and_return_course, \n",
    "                                               course_name, course_id, course_description)\n",
    "            \n",
    "    @staticmethod\n",
    "    def _create_and_return_course(tx, course_name, course_id, course_description):\n",
    "        \n",
    "        query = (\n",
    "            \"CREATE (course:Course {course_id: $course_id, course_name: \\\n",
    "            $course_name, course_description: $course_description})\"\n",
    "            \"RETURN course\"\n",
    "        )\n",
    "\n",
    "        results = tx.run(query, course_id=course_id, \n",
    "                             course_name=course_name, \n",
    "                             course_description=course_description)\n",
    "        \n",
    "    def create_courses(self, csv_path):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._create_courses, csv_path)\n",
    "            \n",
    "    @staticmethod\n",
    "    def _create_courses(tx, csv_path):\n",
    "        assert \"http\" in csv_path, \"Loading csv files from local is \\\n",
    "        not possible due to security reasons, please use online files.\" \n",
    "        query = (\n",
    "            \"LOAD CSV WITH HEADERS FROM $csv_path AS course \\\n",
    "            CREATE (:Course {course_id: course.course_id, \\\n",
    "            course_name: course.course_name, course_description: course.course_description})\"\n",
    "        )\n",
    "        results = tx.run(query, csv_path=csv_path)\n",
    "    \n",
    "    def create_relation(self, course_id, concept_uri):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._create_relation, course_id, concept_uri)\n",
    "    \n",
    "    @staticmethod\n",
    "    def _create_relation(tx, course_id, concept_uri):\n",
    "        query = (\n",
    "            \"MATCH (course:Course), (skill:Skill) \\\n",
    "            WHERE course.course_id = $course_id AND skill.concept_uri = $concept_uri \\\n",
    "            CREATE (course)-[provide_skill:PROVIDE_SKILL]->(skill) \\\n",
    "            RETURN type(provide_skill)\"\n",
    "        )\n",
    "        results = tx.run(query, course_id=course_id, concept_uri=concept_uri)\n",
    "        \n",
    "    def create_relations(self, csv_path):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._create_relations, csv_path)\n",
    "    \n",
    "    @staticmethod\n",
    "    def _create_relations(tx, csv_path):\n",
    "        query = (\n",
    "            \"LOAD CSV WITH HEADERS FROM $csv_path AS relation \\\n",
    "            MERGE (course:Course {course_id: relation.course_id}) \\\n",
    "            MERGE (skill:Skill {concept_uri: relation.concept_uri}) \\\n",
    "            MERGE (course)-[:PROVIDE_SKILL]->(skill)\"\n",
    "        )\n",
    "        results = tx.run(query, csv_path=csv_path)\n",
    "        \n",
    "    def find_skills(self, course_id):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._find_skills, course_id)\n",
    "        return result\n",
    "    \n",
    "    @staticmethod\n",
    "    def _find_skills(tx, course_id):\n",
    "        query = (\n",
    "            \"MATCH (course:Course {course_id: $course_id})-[provide_skill:PROVIDE_SKILL]->(skill) \\\n",
    "            RETURN course.course_name, skill.preferred_label\"\n",
    "        )\n",
    "        results = tx.run(query, course_id=course_id)\n",
    "        skills = []\n",
    "        add_course_name = True\n",
    "        for result in results:\n",
    "            if add_course_name:\n",
    "                course_name = result['course.course_name']\n",
    "                add_course_name = False\n",
    "            skills.append(result['skill.preferred_label'])\n",
    "        return course_name, skills\n",
    "    \n",
    "    def find_courses(self, concept_uri):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._find_courses, concept_uri)\n",
    "        return result\n",
    "\n",
    "    @staticmethod\n",
    "    def _find_courses(tx, concept_uri):\n",
    "        query = (\n",
    "            \"MATCH (skill:Skill {concept_uri: $concept_uri})<-[provide_skill:PROVIDE_SKILL]-(course) \\\n",
    "            RETURN skill.preferred_label, course.course_name\"\n",
    "        )\n",
    "        results = tx.run(query, concept_uri=concept_uri)\n",
    "        courses = []\n",
    "        add_skill_label = True\n",
    "        for result in results:\n",
    "            if add_skill_label:\n",
    "                skill_label = result['skill.preferred_label']\n",
    "                add_skill_label = False\n",
    "            courses.append(result['course.course_name'])\n",
    "        return skill_label, courses"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "3543a20b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('Gebäudeenergieberater', ['zur Instandsetzung von Eisenbahninfrastruktur beraten', 'Baukonstruktionen instand halten', 'Auftragnehmer und Auftragnehmerinnen prüfen', 'Baudokumente vorbereiten', 'Architekten beraten'])\n",
      "('die Grundlagen der Krankenpflege umsetzen', ['490 Stunden Pflegebasiskurs optional mit FS Kl. B', 'Pflegebasiskurs ', '400 Std. Pflegebasiskurs', 'Basiskurs Pflege', 'Basisqualifizierung zur Pflegefachkraft für außerklinische Beatmung (DIGAB zertifiziert)', 'Basiskurs Pflege', 'Basisqualifikation für ungelernte Pflegekräfte (zertifiziert, berufsbegleitend)'])\n"
     ]
    }
   ],
   "source": [
    "if __name__ == \"__main__\":\n",
    "    # Aura queries use an encrypted connection using the \"neo4j+s\" URI scheme\n",
    "    user = \"neo4j\"\n",
    "    \n",
    "    # Jialun\n",
    "    uri = \"neo4j+s://fbb398e7.databases.neo4j.io\"\n",
    "    password = \"3bO4Zwc9eYOyZBQ_CHE49lqd7NKeLSySJAq4flxUtAA\"\n",
    "    \n",
    "# Stefan\n",
    "#     uri = \"neo4j+s://3f32e422.databases.neo4j.io\"\n",
    "#     password = \"Xm3_uLclyVQspJgpSoMKmYONcOIFPZx7WKVrTbiU_ms\"\n",
    "\n",
    "    app = App(uri, user, password)\n",
    "#     app.create_skills(\"https://raw.githubusercontent.com/ingastrelnikova/awt-pj-ss22-learn-tech-2/main/data/all_skills.csv\")\n",
    "#     app.create_courses(\"https://raw.githubusercontent.com/ingastrelnikova/awt-pj-ss22-learn-tech-2/main/data/all_courses.csv\")\n",
    "#     app.create_relations(\"https://raw.githubusercontent.com/ingastrelnikova/awt-pj-ss22-learn-tech-2/main/data/all_relations_ER.csv\")\n",
    "#     app.create_relations(\"https://raw.githubusercontent.com/ingastrelnikova/awt-pj-ss22-learn-tech-2/main/data/all_relations_NN.csv\")\n",
    "#     app.create_relation(\"97FD41FD-1A91-179C-3EA5-6A23E2F436D5\",\"http://data.europa.eu/esco/skill/08fe5910-8c4c-4679-a988-eb2ded3c4909\")\n",
    "#     print(app.find_skills(\"959F8CA7-C845-53DC-7DEB-2E360554F6CE\"))\n",
    "#     print(app.find_courses(\"http://data.europa.eu/esco/skill/516e324b-03fc-4d3b-9986-e46e9834cd43\"))\n",
    "    app.close()\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78121d26",
   "metadata": {},
   "source": [
    "CREATE (ee:Person { name: \"Emil\", from: \"Sweden\", klout: 99 })\n",
    "\n",
    "MATCH (ee:Person) WHERE ee.name = \"Emil\" RETURN ee;\n",
    "\n",
    "CREATE (js:Person { name: \"Johan\", from: \"Sweden\", learn: \"surfing\" }),\n",
    "(ir:Person { name: \"Ian\", from: \"England\", title: \"author\" }),\n",
    "(rvb:Person { name: \"Rik\", from: \"Belgium\", pet: \"Orval\" }),\n",
    "(ally:Person { name: \"Allison\", from: \"California\", hobby: \"surfing\" }),\n",
    "(ee)-[:KNOWS {since: 2001}]->(js),(ee)-[:KNOWS {rating: 5}]->(ir),\n",
    "(js)-[:KNOWS]->(ir),(js)-[:KNOWS]->(rvb),\n",
    "(ir)-[:KNOWS]->(js),(ir)-[:KNOWS]->(ally),\n",
    "(rvb)-[:KNOWS]->(ally)\n",
    "\n",
    "MATCH\n",
    "  (a:Person),\n",
    "  (b:Movie)\n",
    "WHERE a.name = 'Allison' AND b.title = 'The Matrix Revolutions'\n",
    "CREATE (a)-[r:ACTED_IN]->(b)\n",
    "RETURN type(r)\n",
    "\n",
    "MATCH (n) DETACH DELETE n\n",
    "\n",
    "\n",
    "MATCH (n) RETURN n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a7d3c9ae",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
